Autodesk.Revit.DB.Structure.SurfaceDistributionRebarHandles
This enum represents the values that custom handles tags of RebarConstrainedHandle of Rebar Free Form Surface Distribution have.
The tag of a Autodesk::Revit::DB::Structure::RebarHandleType::CustomHandle RebarConstrainedHandle
can be obtained by calling the Autodesk::Revit::DB::Structure::RebarConstrainedHandle::GetCustomHandleTag()
Since:
2026
Since:
2026

Autodesk.Revit.DB.Structure.SurfaceDistributionRebarHandles.EndSurface
Tag for handle representing the End Surface. This handle accepts constraints only to host faces or to covers.

Autodesk.Revit.DB.Structure.SurfaceDistributionRebarHandles.StartSurface
Tag for handle representing the Start Surface. This handle accepts constraints only to host faces or to covers.

Autodesk.Revit.DB.Structure.SurfaceDistributionRebarHandles.HostSurface
Tag for handle representing the Host Surface. This handle accepts constraints only to host faces or to covers.